<!DOCTYPE html>
  <html>
    <head>
      <meta charset="UTF-8">
      <link rel="stylesheet" href="style/table.css">
        <link rel="shortcut icon" href="/favicon.ico">
      <title>Zhufyak Vadym PHP Lab</title>
    </head>
    <body>
            <table class="table-style">
                <tr>
                    <td colspan="2" class="text-center"><b>Жуф'як Вадим. Варіант 8.</b></td>
                </tr>
                <tr>
                    <td colspan="2">
                        <b>Вхідні дані:</b><br>
                        Файл містить інформацію про навчальні предмети у вигляді: назва предмету,  номер семестру, в якому читається, кількість годин, форма контролю (залік, іспит), прізвище й ім’я лектора.
                    </td>
                </tr>
                <tr>
                    <td colspan="2">
                        <b>Лабораторна робота №1 (Структура сайту – 1 балів)</b><br>
                        Розробити структуру головної сторінки сайту з посиланнями на лабораторні роботи в якості пунктів меню і розмістити на цій сторінці інформацію про автора.
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №2 (Обробка файлів – 4 балів)</b> <br>
                        Отримати всю інформацію із файлу і вивести її у вікно браузера. Створити форму для добавлення нового запису у файл і реалізувати її обробку.
                    </td>
                    <td class="text-center"><a href="add_form.php">Add Form</a></td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №3 (Масиви – 5 балів)</b><br>
                        Вивести усі навчальні предмети впорядковані за зростанням номерів семестрів в якому читається й кількість різних лекторів, що зустрічаються у файлі.
                    </td>
                    <td class="text-center" rowspan="2"><a href="table.php">Table</a></td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №4 (Стрічки – 5 балів)</b><br>
                        У форму вводиться набір символів. Вивести у вікно браузера усі навчальні предмети, назви яких містять задані символи.
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №5 (Робота з БД – 7 балів)</b><br>
                        Для заданої предметної області створити базу даних, що складатиметься із однієї таблиці. Реалізувати задачі із ЛР2, ЛР3, ЛР4 за допомогою таблиці бази даних.
                    </td>
                    <td rowspan="3">
                        <a href="plan.php">Plan</a><br>
                        <a href="plan_add.php">Add Plan</a><br>
                        <a href="subject_edit.php">Subject</a><br>
                        <a href="lector_edit.php">Lector</a><br>
                        <a href="group_edit.php">Group</a><br>
                        <a href="department_edit.php">Department</a><br>
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №6 (Робота з БД – 5 балів)</b><br>
                        Нормалізувати базу даних, що створена у ЛР5. Реалізувати задачі із ЛР2, ЛР3, ЛР4 за допомогою нормалізованої бази даних.
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №7 (Класи – 8 балів)</b><br>
                        Створити клас, атрибутами якого мають стати поля заданої предметної області. Написати методи: записати об’єкт у бд, отримати об’єкт за заданим атрибутом, отримати інформацію про всі предмети, що читаються заданим викладачем.
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №8 (Управління датою і часом – 5 балів)</b><br>
                        Вивести дату, яка буде через 2 тижні від вказаної дати.
                    </td>
                    <td>
                        <a href="date++.php">Date++</a>
                    </td>
                </tr>
                <tr>
                    <td>
                        <b>Лабораторна робота №9(Створення зображень – 5 балів)</b><br>
                        Задано два числа X і Y, а також файл графічного зображення. Отримати нове зображення, вирізавши в центрі графічного заданого зображення
                    </td>
                    <td>

                    </td>
                </tr>
                <tr><th class="text-center" colspan="2"><a href="https://github.com/zhufyakvv/PHP_Labs">GitHub</a></th></tr>
            </table>
    </body>
</html>      