
<!DOCTYPE html>
<html>
<?php
$page_thumbnail = "Це все про мене.";
$page_title = "Orel.com";
include "parts/head.php";
?>
<body>
<?php
include "parts/navigation.php";
    ?>
    <div class="content">
        <div class="container">
            <div class="post" style="text-indent: 25px;">
                <p>
                <strong>Михайло Михайлович Поплавський</strong> відомий як <i>співак, генеральний продюсер, головний режисер-постановник,
                    автор численних мистецьких проектів</i>, зокрема: Всеукраїнського дитячого телеконкурсу «Крок до зірок», батл-шоу «Наша пісня»,
                Шевченківського вечора «Ми діти твої, Україно!», концертної програми до Міжнародного дня матері «Мамо, вічна і кохана»,
                музичного телемарафону «Пісня об'єднує нас».
                </p>
                <p>
                На думку редактора телекритики <i>І. Долженкової</i>, <strong>М. Поплавський</strong> зберігає популярність завдяки тому, що він
                <strong><i>«інтуїтивно апелює до прадавніх, але успішно придушених вимушеною цивілізованістю рис української ментальності з її неодмінним
                        сентиментом до свого „ставка, млинка й вишневого садка“»</i></strong> і залишається єдиним діячем, що пропагує в українському телеефірі українську пісню.
                В той же час Поплавського критикували за несмак, зокрема політик <i>Ганна Герман</i>.
                Критик <i>Тамара Гундорова</i> відзначає у творчості Попалвського використання стереотипних кліше української ідентичності —
                <u>«вареники», «сало», «борщ»,</u> за допомогою яких продукується «спрощений, екзотично-забарвлений образ українського світу».
                </p>
                <p>
                Журналіст <i>О. Супруненко</i> свідчить про принцип <strong>«сім П»</strong>, що лежить в основі успіху команді Поплавського:
                <strong><i>«професіоналізм, патріотизм, порядність, потужно працювати та прєданность Поплавському»</i></strong>
                </p>
                <p>
                У 2006–2010 роках М. Поплавський дав ряд концертів, що називалися <u>«прощальними»</u> в різних містах України,
                що не завадило, однак, продовжити Поплавському виступати й надалі.
                </p>
            </div>
        </div>
    </div>
<?php

include "parts/footer.php";
?>
<!-- Javascript -->
<script src="js/jquery.min.js"></script>
<script src="js/kube.min.js"></script>
</body>
</html>